ADD AMOUNT TO BALANCE.
SUBTRACT TAX FROM BALANCE.

IF BALANCE > 1000
   SUBTRACT TAX FROM BALANCE
END-IF.

ADD INCOME TO BALANCE.
SUBTRACT RENT FROM BALANCE.
ADD REFUND TO BALANCE.
SUBTRACT PENALTY FROM BALANCE.